Tekla Open API Reference for Tekla Structures 2025
AnalysisModelIssue.Type Property
 Gets or sets the issue type
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelIssue.TypeEnum Type { get; set; }
Public Property Type As AnalysisModelIssue.TypeEnum
	Get
	Set
Property Value
Type: AnalysisModelIssue.TypeEnum
See Also
Reference
AnalysisModelIssue Class
Tekla.Structures.Analysis Namespace